{
  "online_content": {
    "type": "doc",
    "content": [
      {
        "type": "heading",
        "attrs": {
          "level": 1
        },
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "bold"
              }
            ],
            "text": "The Tangled Web: Copyright, AI, and the Content ID Conundrum"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "While browsing YouTube last week, I came across "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.youtube.com/watch?v=LrkAORPiaEA",
                  "target": "_blank",
                  "rel": "noopener",
                  "class": "text-muted-foreground underline underline-offset-[3px] hover:text-primary transition-colors cursor-pointer"
                }
              }
            ],
            "text": "a video"
          },
          {
            "type": "text",
            "text": " exploring how AI-generated content, when combined with YouTube’s Content ID system, could pose a greater threat to musicians than patent trolls have been to engineers."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The burgeoning field of AI-generated content is sparking a complex and often contentious debate surrounding copyright. The fundamental question of who owns what when an algorithm, trained on a vast dataset that inevitably includes copyrighted material, produces a new work, remains largely unanswered and presents a significant challenge to existing legal frameworks."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The implications are far-reaching, potentially impacting not only artists, musicians, and writers but also the very future of creative industries."
          },
          {
            "type": "hardBreak"
          },
          {
            "type": "hardBreak"
          },
          {
            "type": "text",
            "text": "Let’s dig into the growing collision between AI, copyright law, and automated content enforcement systems — and what it could mean for the future of creative work."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "We’ll close with my Product of the Week, which almost looks like it came out of a 1950s-era sci-fi horror movie: Orb, from Tools for Humanity, designed to prove you’re a human."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "bold"
              }
            ],
            "text": "Who Owns AI-Generated Content?"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The core of the copyright problem with AI-generated content lies in the traditional legal requirement of human authorship."
          }
        ]
      }
    ]
  },
  "online_content_time": "2025-06-11T13:46:23.633Z"
}