{
  "online_content": {
    "type": "doc",
    "content": [
      {
        "type": "heading",
        "attrs": {
          "level": 1
        },
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "bold"
              }
            ],
            "text": "The Tangled Web: Copyright, AI, and the Content ID Conundrum"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "While browsing YouTube last week, I came across "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.youtube.com/watch?v=LrkAORPiaEA",
                  "target": "_blank",
                  "rel": "noopener",
                  "class": "text-muted-foreground underline underline-offset-[3px] hover:text-primary transition-colors cursor-pointer"
                }
              }
            ],
            "text": "a video"
          },
          {
            "type": "text",
            "text": " exploring how AI-generated content, when combined with YouTube’s Content ID system, could pose a greater threat to musicians than patent trolls have been to engineers."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The burgeoning field of AI-generated content is sparking a complex and often contentious debate surrounding copyright. The fundamental question of who owns what when an algorithm, trained on a vast dataset that inevitably includes copyrighted material, produces a new work, remains largely unanswered and presents a significant challenge to existing legal frameworks."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The implications are far-reaching, potentially impacting not only artists, musicians, and writers but also the very future of creative industries."
          },
          {
            "type": "hardBreak"
          },
          {
            "type": "hardBreak"
          },
          {
            "type": "text",
            "text": "Let’s dig into the growing collision between AI, copyright law, and automated content enforcement systems — and what it could mean for the future of creative work."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "We’ll close with my Product of the Week, which almost looks like it came out of a 1950s-era sci-fi horror movie: Orb, from Tools for Humanity, designed to prove you’re a human."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "bold"
              }
            ],
            "text": "Who Owns AI-Generated Content?"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The core of the copyright problem with AI-generated content lies in the traditional legal requirement of human authorship."
          },
          {
            "type": "hardBreak"
          },
          {
            "type": "text",
            "text": "In its current form, copyright law primarily protects works that are the product of human intellect and creativity. Because AI is a tool, it doesn’t possess legal personhood or intent. Therefore, the act of an AI generating an image, a piece of music, or a block of text doesn’t neatly fit into the established definition of authorship."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Is the copyright held by the user who prompted the AI? By the developers who created and trained the model? Or is the output inherently uncopyrightable and falls into the public domain? These are the thorny questions that legal systems around the world are grappling with, often struggling to keep pace with the rapid advancements in AI capabilities."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The challenge is compounded by the datasets on which these AI models are trained. These massive collections of text, images, audio, and video often contain vast amounts of copyrighted material. While the models learn patterns and styles from this data, the extent to which this constitutes copyright infringement is another significant legal gray area."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "hardBreak"
          },
          {
            "type": "text",
            "text": "Here’s how this problematic scenario could unfold:"
          }
        ]
      },
      {
        "type": "orderedList",
        "attrs": {
          "tight": true,
          "start": 1,
          "type": null
        },
        "content": [
          {
            "type": "listItem",
            "content": [
              {
                "type": "paragraph",
                "content": [
                  {
                    "type": "text",
                    "text": "A human musician develops a distinctive and popular musical style."
                  }
                ]
              }
            ]
          },
          {
            "type": "listItem",
            "content": [
              {
                "type": "paragraph",
                "content": [
                  {
                    "type": "text",
                    "text": "An AI model is trained on a large dataset that includes this musician’s work."
                  }
                ]
              }
            ]
          },
          {
            "type": "listItem",
            "content": [
              {
                "type": "paragraph",
                "content": [
                  {
                    "type": "text",
                    "text": "The AI generates a new musical piece that’s not a direct copy but strongly resembles the stylistic hallmarks of the original artist."
                  }
                ]
              }
            ]
          },
          {
            "type": "listItem",
            "content": [
              {
                "type": "paragraph",
                "content": [
                  {
                    "type": "text",
                    "text": "This AI-generated piece is uploaded and registered with a content identification system like Content ID."
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  },
  "online_content_time": "2025-06-11T13:47:12.633Z"
}