{
  "online_content": {
    "type": "doc",
    "content": [
      {
        "type": "image",
        "attrs": {
          "src": "https://raw.githubusercontent.com/bq-praveen-33/novel-data/main/docs/notes/6881d0a0a991773e0be967b3/images/image.png-bc5b41bd-ebf1-46e3-bcce-e47aad0b030e",
          "alt": null,
          "title": null,
          "width": 717,
          "height": 194.05
        }
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "ai-highlight",
                "attrs": {
                  "color": "#c1ecf970"
                }
              }
            ],
            "text": "Java is a high-level, versatile programming language that was developed by Sun Microsystems in the mid-1990s. It is designed to be platform-independent, which means that Java code can run on any device that has a Java Virtual Machine (JVM) installed. This is often summarized by the phrase \"Write Once, Run Anywhere\" (WORA), making Java a popular choice for cross-platform applications. "
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "ai-highlight",
                "attrs": {
                  "color": "#c1ecf970"
                }
              }
            ],
            "text": "One of the defining features of Java is its obje"
          },
          {
            "type": "text",
            "text": "ct-oriented nature, which allows devimport { Button } from \"../ui/button\";"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "elopers to create modular programs and reusable code. This approach promotes better orgreusable code. This approach promotes better organization and easier maintenanceanization and easier maintenance of software. Java supports key object-oriented principles such as inheritance, encapsulation, and polymorphism.  "
          }
        ]
      },
      {
        "type": "codeBlock",
        "attrs": {
          "language": null
        },
        "content": [
          {
            "type": "text",
            "text": "public class SimpleProgram {\n    public static void main(String[] args) {\n        // Print Hello World\n        System.out.println(\"Hello, World!\");\n\n        // Declare two numbers\n        int num1 = 10;\n        int num2 = 20;\n\n        // Calculate sum\n        int sum = num1 + num2;\n\n        // Print result\n        System.out.println(\"Sum of \" + num1 + \" and \" + num2 + \" is: \" + sum);\n    }\n}"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Java is widely used in various domains, including web development, mobile applications (especially Android), enterprise-level applications, and scientific computing. Frameworks such as Spring and Hibernate further extend Java's capabilities, offering powerful tools for building robust applications."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Another significant aspect of Java is its emphasis on security. The language was designed with a focus on preventing common programming errors and vulnerabilities, making it a preferred choice for applications that require secure transactions. This focus on security, combined with its versatility and extensive libraries, solidifies Java's position as a leading programming language in the software development landscape."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Another significant aspect of Java is its emphasis on security. The language was designed with a focus on preventing common programming/   errors and vulneuting. Frameworks such as Spring and Hibernaterabiliti   es, huting. Frameworks such as Spring and Hibernategcvjhcfjhvhvhjvjvhjvhvjhh.//making it a preferred choic applications that require secure transactions."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "In summary, Java is a powerful and widely-used programming language that offers flexibility, security, and a vast ecosystem of tools and libraries, making it suitable  for a broad range of applications. "
          }
        ]
      }
    ]
  },
  "online_content_time": "2025-07-25T18:03:03.278Z"
}