{
  "online_content": {
    "type": "doc",
    "content": [
      {
        "type": "heading",
        "attrs": {
          "level": 1
        },
        "content": [
          {
            "type": "text",
            "text": "The Taj Mahal: An Architectural Marvel"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "Introduction"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The Taj Mahal, an iconic symbol of love, is one of the most remarkable structures in the world. Located in Agra, India, it is a UNESCO World Heritage Site and is renowned for its stunning beauty and intricate craftsmanship. Built in the 17th century, the Taj Mahal stands as a testament to the artistry of Mughal architecture and is a significant part of India's cultural heritage."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "Historical Background"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The Taj Mahal was commissioned by Emperor Shah Jahan in memory of his beloved wife, Mumtaz Mahal, who died during childbirth. Construction began in 1632 and was completed in 1653, involving thousands of artisans, craftsmen, and laborers. The monument not only reflects the grandeur of the Mughal empire but also embodies the deep love Shah Jahan had for Mumtaz Mahal."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "Architectural Features"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "Design and Layout"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The Taj Mahal is a stunning example of Mughal architecture, which combines elements from Persian, Islamic, and Indian architectural styles. The main structure is a symmetrical building made of white marble, adorned with intricate carvings and inlaid gemstones. The layout of the Taj Mahal follows a classic Mughal garden design, featuring a vast reflecting pool that enhances its beauty."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "The Dome"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The central dome of the Taj Mahal rises to a height of 35 meters and is surrounded by four smaller domes. The dome's unique design, with its graceful curves, symbolizes the heavens and serves as a focal point for the entire structure."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "Decorative Elements"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The exterior and interior of the Taj Mahal are richly decorated with calligraphy, floral motifs, and geometric patterns. The use of semi-precious stones, such as lapis lazuli and jade, for inlay work further exemplifies the exquisite craftsmanship that went into its creation."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "Cultural Significance"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The Taj Mahal is not only a marvel of architecture but also a symbol of eternal love. It attracts millions of visitors each year, making it one of the most visited monuments in the world. It has inspired countless poems, songs, and films, reinforcing its status as a cultural icon."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "Preservation Efforts"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "In recent years, the Taj Mahal has faced challenges due to pollution and environmental factors. Efforts are ongoing to preserve its beauty and structural integrity, including initiatives to reduce air pollution in the Agra area and restore its marble façade."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "textStyle",
                "attrs": {
                  "color": "rgb(244, 244, 245)"
                }
              }
            ],
            "text": "h"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The Taj Mahal remains an enduring symbol of love and a masterpiece of architectural brilliance. Its historical significance, architectural beauty, and cultural impact make it a must-visit destination for people from around the world. As we admire this extraordinary monument, we are reminded of the power of love and the artistry of human creativity."
          }
        ]
      },
      {
        "type": "horizontalRule"
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "This content is structured to provide a comprehensive overview of the Taj Mahal, suitable for the \"tarun123456789\" note. It includes sections on history, architecture, cultural significance, and preservation, ensuring a well-rounded understanding of this magnificent monument."
          }
        ]
      }
    ]
  },
  "online_content_time": "2025-07-31T13:09:44.606Z"
}