{
  "online_content": {
    "type": "doc",
    "content": [
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Machine learning is a subset of artificial intelligence that focuses on the development of algorithms and statistical models that enable computers to perform specific tasks without explicit instructions. Instead of relying on hard-coded rules, machine learning allows systems to learn from and make predictions or decisions based on data"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "At its core, machine learning involves feeding large amounts of data into algorithms that can identify patterns and make inferences. These algorithms can be categorized into three main types: supervised learning, unsupervised learning, and reinforcement learning."
          }
        ]
      },
      {
        "type": "orderedList",
        "attrs": {
          "tight": false,
          "start": 1,
          "type": null
        },
        "content": [
          {
            "type": "listItem",
            "content": [
              {
                "type": "paragraph",
                "content": [
                  {
                    "type": "text",
                    "marks": [
                      {
                        "type": "bold"
                      }
                    ],
                    "text": "Supervised Learning"
                  },
                  {
                    "type": "text",
                    "text": ": In this approach, the model is trained on a labeled dataset, where the input data is paired with the correct output. The algorithm learns to map inputs to the desired outputs, making it effective for tasks such as classification and regression. Examples include spam detection in emails and predicting house prices based on various features."
                  }
                ]
              }
            ]
          },
          {
            "type": "listItem",
            "content": [
              {
                "type": "paragraph",
                "content": [
                  {
                    "type": "text",
                    "marks": [
                      {
                        "type": "bold"
                      }
                    ],
                    "text": "Unsupervised Learning"
                  },
                  {
                    "type": "text",
                    "text": ": Unlike supervised learning, unsupervised learning deals with unlabeled data. The model tries to identify patterns and relationships within the data without prior knowledge of the outcomes. Common applications include clustering (grouping similar data points) and dimensionality reduction (simplifying data while retaining its structure). An example is customer segmentation in marketing."
                  }
                ]
              }
            ]
          },
          {
            "type": "listItem",
            "content": [
              {
                "type": "paragraph",
                "content": [
                  {
                    "type": "text",
                    "marks": [
                      {
                        "type": "bold"
                      }
                    ],
                    "text": "Reinforcement Learning"
                  },
                  {
                    "type": "text",
                    "text": ": This type of learning is inspired by behavioral psychology and involves training an agent to make decisions by taking actions in an environment to maximize cumulative reward. The agent learns from the consequences of its actions, making it particularly useful in areas like robotics, game playing, and autonomous systems."
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Machine learning has seen significant advancements in recent years, driven by increased computational power, the availability of large datasets, and improved algorithms. Applications span various fields, including healthcare (for disease prediction and diagnosis), finance (for fraud detection and risk assessment), advertising (for targeted marketing), and many more."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Machine learning has seen significant advancements in recent years, driven by increased computational power, the availability of large datasets, and improved algorithms. Applications span various fields, including healthcare (for disease prediction and diagnosis), finance (for fraud detection and risk assessment), advertising (for targeted marketing), and many more."
          }
        ]
      },
      {
        "type": "paragraph"
      }
    ]
  },
  "online_content_time": "2025-08-07T13:28:26.362Z"
}